it/src/Documents/ПланЗакупокЛицензий/ПланЗакупокЛицензий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланЗакупокЛицензий</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАнализа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Лицензии</name>
    <attributes>
      <name>Программа</name>
      <type>
        <types>CatalogRef.ИдентификаторыПрограмм</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Поддержка</name>
    <attributes>
      <name>Программа</name>
      <type>
        <types>CatalogRef.ИдентификаторыПрограмм</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

it/src/Documents/ПланЗакупокЛицензий/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПолучитьЗапасыИзХранилища(АдресДанныхВХранилище)
	
	СтруктураДанных = ПолучитьИзВременногоХранилища(АдресДанныхВХранилище);
	
	Для каждого СтрокаЗагрузки Из СтруктураДанных.ТаблицаНеобходимыхЛицензий Цикл
		
		НоваяСтрока = Объект.Лицензии.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗагрузки);
	
	КонецЦикла;
	
	Для каждого СтрокаЗагрузки Из СтруктураДанных.ТаблицаНеобходимойПоддержки Цикл
		
		НоваяСтрока = Объект.Поддержка.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗагрузки);
	
	КонецЦикла;
	
КонецПроцедуры // ПолучитьЗапасыИзХранилища()

&НаКлиенте
Процедура ПолучитьНеобходимоеДанные(Команда)
	
	ПараметрыПодбора = Новый Структура;
	
	ПараметрыПодбора.Вставить("ДатаАнализа", 		Объект.Дата);
	ПараметрыПодбора.Вставить("Организация",		Объект.Организация);
	
	АдресДанныхВХранилище = ОткрытьФормуМодально("ОбщаяФорма.ПолучениеДанныхОЗакупках", ПараметрыПодбора);
	
	Если ЗначениеЗаполнено(АдресДанныхВХранилище) Тогда
		ПолучитьЗапасыИзХранилища(АдресДанныхВХранилище);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтоимостьЛицензииНаСервере()
	
	ОбщегоНазначенияСервер.ЗаполнитьСтоимостьюПоПрограммам(Объект, "Лицензии", Истина, Ложь);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтоимостьЛицензии(Команда)
	ЗаполнитьСтоимостьЛицензииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтоимостьПоддержкиНаСервере()
	
	ОбщегоНазначенияСервер.ЗаполнитьСтоимостьюПоПрограммам(Объект, "Поддержка", Ложь, Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтоимостьПоддержки(Команда)
	ЗаполнитьСтоимостьПоддержкиНаСервере();
КонецПроцедуры
